#ifndef DATASTRUCTS_H
#define DATASTRUCTS_H
#include <QString>



#include "../common/data.h"


inline const QString nameMassive[] = {"Часы","Минуты","Секунды","Вес топлива, кг","слово данных","адрес (в 16-тиричном представлении)",
"какой-то резерв, не нужно для использования","признак корректности данных","признак нахождения на земле",
"скорость, км/ч (цена старшего разряда - 512)","какой-то резерв, не нужно для использования",
"матрица состояния(00 - отказ, 01 – нет данных, 10 – тест, 11 - нормальная работа)","бит контроля чётности","признак разрушения"};



#endif // DATASTRUCTS_H
